import { useNavigate } from "react-router-dom";
import React, { useState } from "react";
export const DetailsOfTheLead = () => {


//-leadHomePageלדף הזה מגיעים מהדף הראשי 
//יש לנו לינק שלוחצים על מתעניין מגיעים לדף הזה
//הדף בנוי בצורת טופס ולכן אין כל כך מה להראות כאן בעצם אני אמורה למלא את הדף הזה בעת רישום מתעניין 
//ומאז הוא מלא כל פעם שרוצים לראות את פרטי המתעניין 
//הטופס שלי מכיל את כל הפרטים הנל כמובן שצריך לבדוק שהכל יהיה תקין..
/*
תעודת זהות:
שם:
טלפון:
דוא"ל:
סוג עסק:
מתעניין ב:
מקור:
סטטוס:
תאריך יצירת קשר?:
מעקב עדכון?:
הערות?:
אינטראקציות:גרף
נוצר בתאריך:
עודכן בתאריך:
*/
//
// <Button onClick={} variant="primary" size="sm" > אנטרקציה של המתעניין </Button>  
//זה כפתור שמעביר אותי לאינטרקציות של המתעניין לא ברור עדיין אם צריך לכל מתעניין בנפרד או רק שיהיה את של כולם ביחד 
    return <div className='detailsOfTheLead'>
        <h1>detailsOfTheLead</h1>      
       {/*פרטי המתענינים*/}  
       

    </div>
}