export const InterestedCustomerRegistration = () => {
    //כל הפרטים שחסר לי ואני צריכה למלא כי אין לי אותם עדיין
    // (פונקציית השואה בין מה שאני צריכה בעצם כל הפרטים שיש לי לכל לקוח לבין מה שיש לי ויביא לי רק את מה שאין לי ואני יצטרך למלא את זה .
    //אמור להיות טופס של כל הפרטים שחסר לי על המתעניין 
    //  <Button onClick={דף של החוזה} variant="primary" size="sm" >לינק לחוזה </Button>
    // וחוץ מזה כפתור שמעביר לחוזה
    //ברגע שאני עוברת לחוזה אני צריכה שיעבור איתי הפרטים שאני כבר יודעת וצריך אותם בחוזה שהמזכירה לא תצטרך לעבוד כפול 
    return <div className='interestedCustomerRegistration'>
        <h1>interestedCustomerRegistration</h1>      
       {/*החלפת מתעניין ללקוח*/}  
       

    </div>
}